Ran Plan for dir: `terraform/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # tls_self_signed_cert.ca has been changed
~ resource "tls_self_signed_cert" "ca" {
        id                    = "129989449354626896442643147606346984849"
        # (10 unchanged attributes hidden)

      ~ subject {
          + street_address = []
            # (2 unchanged attributes hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_secret.tls will be created
+ resource "kubernetes_secret" "tls" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "wayofthesys-com-argocd-tls"
          + namespace        = "atlantis"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # tls_cert_request.request will be created
+ resource "tls_cert_request" "request" {
      + cert_request_pem = (known after apply)
      + dns_names        = [
          + "atlantis",
          + "atlantis.local",
          + "atlantis.default.svc.cluster.local",
          + "localhost",
          + "argocd.wayofthesys.com",
        ]
      + id               = (known after apply)
      + ip_addresses     = [
          + "127.0.0.1",
          + "138.197.48.247",
        ]
      + key_algorithm    = "RSA"
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name  = "argocd.wayofthesys.com"
          + organization = "Atlantis"
        }
    }

  # tls_locally_signed_cert.cert will be created
+ resource "tls_locally_signed_cert" "cert" {
      + allowed_uses          = [
          + "cert_signing",
          + "client_auth",
          + "digital_signature",
          + "key_encipherment",
          + "server_auth",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = "RSA"
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_private_key.key is tainted, so must be replaced
-/+ resource "tls_private_key" "key" {
      ~ id                         = "a311f04c015211547bfeebbf2d92a331173542e4" -> (known after apply)
      ~ private_key_pem            = (sensitive value)
      ~ public_key_fingerprint_md5 = "60:56:6a:c8:2c:c9:25:fe:f3:81:47:0f:1f:09:f9:8c" -> (known after apply)
      ~ public_key_openssh         = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCytko4KNgjlOtSC2YV2/htXXkyImnYfHOiiF/7MlP8/RjX73Ee0zywPQ/rPmMZeaKD4A/bizttnDtgSHSFkJwGF+7rG/+M5NCArKMLmSm902EOJRt7ZrPlleki20dwcQqiGujQwwqoT/VsPGm8PTSJqCoY7NNVnnVopIWCZpinQyicTNK3Jwf9NBBzqPcCbwRlJh/LjnduaIljoKC/DaJS4AVf/fN8q6XLYdH6AD3oONxTDayjMKJzllEotG2PA9cNanCvENs9+zfYA1b/wqE7i11FZOkNM0cnN76+MlxcBCHuol3w0qB5OxFUEin5y4Bhp/7D9p/PMr33A0XpSAX/
        EOT -> (known after apply)
      ~ public_key_pem             = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAsrZKOCjYI5TrUgtmFdv4
            bV15MiJp2Hxzoohf+zJT/P0Y1+9xHtM8sD0P6z5jGXmig+AP24s7bZw7YEh0hZCc
            Bhfu6xv/jOTQgKyjC5kpvdNhDiUbe2az5ZXpIttHcHEKohro0MMKqE/1bDxpvD00
            iagqGOzTVZ51aKSFgmaYp0MonEzStycH/TQQc6j3Am8EZSYfy453bmiJY6Cgvw2i
            UuAFX/3zfKuly2HR+gA96DjcUw2sozCic5ZRKLRtjwPXDWpwrxDbPfs32ANW/8Kh
            O4tdRWTpDTNHJze+vjJcXAQh7qJd8NKgeTsRVBIp+cuAYaf+w/afzzK99wNF6UgF
            /wIDAQAB
            -----END PUBLIC KEY-----
        EOT -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # tls_self_signed_cert.ca is tainted, so must be replaced
-/+ resource "tls_self_signed_cert" "ca" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDGDCCAgCgAwIBAgIQYcsOqv4/C05t+CfqGxxtkTANBgkqhkiG9w0BAQsFADAm
            MREwDwYDVQQKEwhBdGxhbnRpczERMA8GA1UEAxMIY2EubG9jYWwwHhcNMjIwMzA1
            MjIyMDM5WhcNMjMwMzA1MjIyMDM5WjAmMREwDwYDVQQKEwhBdGxhbnRpczERMA8G
            A1UEAxMIY2EubG9jYWwwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDc
            fPPIaxPWZOSAuR8v92BUmSSw2+gKe3pwSy463fJpfnxBBB0RoANQGKCxVtFi632n
            rGpcG9yK8ssLP92ZdcFRQppYj28i9HNDIPAy0f7Sghakpeawkw04wBrqz5V9vKUn
            NeCa+6F2DqtAh6B4AxtVDwPOTL98EtrcE9pL/Z61bXmJcERiKisz+G/2qxO+Qdqd
            ZlBY1IyiYeilLzDrbQIse/aO/4FEkWk70rg0lGYcSpEc0+9gUqBQe9yBQnx76yJF
            mdMEkZ4o+t8xdX7wyZb0BwnU7Mh51jkFkBKQZXg6f2lN9hxrxahpYkCv/n1fIvX8
            wahWMdtFCm/kvD0Aavu7AgMBAAGjQjBAMA4GA1UdDwEB/wQEAwICpDAPBgNVHRMB
            Af8EBTADAQH/MB0GA1UdDgQWBBSJfuafsHgGStuAhKTxd5wmEyP2jDANBgkqhkiG
            9w0BAQsFAAOCAQEAvDG5hy7kTK6Y800M316uquheNrv18BFuKfn1x8o9kboi0voo
            G5s/PrSGSNifnsYMD8JDvtJ2RyCmbKsQwTzD7fGoVkfPRbIvu4iffBkL6lYeTAYN
            a7aLuKD4oMS18yKSKg/heZSj3ymzwTIxdZHRjOWQWqFhzVEWjDWvFX7HaClHojaf
            FQLCVyGPr0n3e9G7iISAZAQziFAQApaYI6sBTfHbkfqTomqGlBkV+fjykLWo8Cie
            UtP1rwuqHR8PIQI/OrSDtLHjoqyBQfvHEwT4CDa7I49oDsQ/kUYsI1qIOmZ57hB5
            Msn95kS9RcNI361cNnt4zJqJUsCB52CO1VhbUA==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id                    = "129989449354626896442643147606346984849" -> (known after apply)
      ~ ready_for_renewal     = false -> true
      ~ validity_end_time     = "2023-03-05T22:20:39.572273642Z" -> (known after apply)
      ~ validity_start_time   = "2022-03-05T22:20:39.572273642Z" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ subject {
          - street_address = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 5 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
